// Задача 1. Дано масив рядків. Вивести ті, у яких є цифри
// (використати метод test та регулярні вирази).
console.log('Задача 1');
let array1 = ['Дано', 'a45e', 'масив', '5 рядків', 'Вивести 9', 'ті', 'у', 'яких', 'є', '458961']
array1.forEach(element => {
	if(/\d/.test(element))
	console.log(element)
})
// --------------------------------------------------------

// Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.
console.log('Задача 2');
let array2 = ['Дано', 'a45e', 'масив', '5 рядків', 'Вивести 9', 'ті', 'у', 'яких', 'є', '458961']
array2.forEach(element => {
	if(!/\d/.test(element))
	console.log(element);
})
// ------------------------------------------------------------

// Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.
console.log('Задача 3');
let array3 = ['Дано', 'a45e', 'масив', '5 рядків', 'Вивести 9', 'ті', 'у', 'яких', 'є', '458961','hi']
array3.forEach(element => {
	if(/[аеоуяиюєї]/.test(element))
	console.log(element);
});
// ------------------------------------------------------------

// Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.
console.log('Задача 4');
let array4 = ['Дано', '45', 'масив', '5 рядків', 'Вивести 3', 'ті', 'у', 'яких', 'є', '458961','hi']
array4.forEach(element => {
	if(!/[аеоуіяиюєї]/.test(element))
	console.log(element);
});
// ------------------------------------------------------------

// Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.
console.log('Задача 5');
let array5 = ['Дано', '45', 'масив', '5 рядків', 'Вивести 3', 'ті', 'у', 'яких', 'є', '458961','hi']
array5.forEach(element => {
	if(/[13]/.test(element))
	console.log(element);
});
// ------------------------------------------------------------

// Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.
console.log('Задача 6');
let str6 = 'росія в ніч на 2 червня атакувала Україну 15 крилатими ракетами і 21 ударним дроном, українські військові знищили усі повітряні цілі, повідомляє у телеграмі пресслужба Повітряних сил ЗСУ.'
let numbers = str6.match(/\d/g)
console.log(numbers);

// ------------------------------------------------------------

// Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.
console.log('Задача 7');
let str7 = 'росія в ніч на 2 червня атакувала Україну 15 крилатими ракетами і 21 ударним дроном, українські військові знищили усі повітряні цілі, повідомляє у телеграмі пресслужба Повітряних сил ЗСУ.'
let punctuatiunMarks = str7.match(/[,.:;?!-]/g)
console.log(punctuatiunMarks)
// ------------------------------------------------------------

// Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.
console.log('Задача 8');
let str8 = 'росія в ніч на 2 червня атакувала Україну 15 крилатими ракетами і 21 ударним дроном, українські військові знищили усі повітряні цілі, повідомляє у телеграмі пресслужба Повітряних сил ЗСУ.'
let task8 = str8.split(',')
console.log(task8);
// ------------------------------------------------------------

// Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).
console.log('Задача 9');
let str9 = 'Lorem ipsum, dolor sit amet consectetur 03.06.2023 adipisicing elit. Iste laborum quasi ipsam corrupti blanditiis nemo vero natus ut tenetur fugiat, sint odit mollitia assumenda! Similique nulla natus et vero! Et?'
let task9 = str9.match(/\b\d{2}\.\d{2}\.\d{4}\b/g)
console.log(task9);
// ----------------------------------------------------------

// Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.
console.log('Задача 10');
let str10 = 'росія в ніч на 2 червня атакувала Україну 15 крилатими ракетами і 21 ударним дроном, українські військові знищили усі повітряні цілі, повідомляє у телеграмі пресслужба Повітряних сил ЗСУ.'
let task10 = str10.match(/\b\d{2}\b/g)
console.log(task10);
// ---------------------------------------------------------------------------

//Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434»). Знайти усі такі номери.
console.log('Задача 11');
let str11 = 'росія в ніч на 2 червня атакувала Україну 15 крилатими «4142-3433-2323-3434» ракетами і 21 ударним дроном, українські військові знищили усі повітряні цілі, повідомляє у телеграмі пресслужба Повітряних сил ЗСУ.'
let task11 = str11.match(/\b\d{4}\-\d{4}\-\d{4}\-\d{4}\b/g)
console.log(task11);
// ---------------------------------------------------------------------------------

// Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”)
console.log('Задача 12');
let str12 = 'https://ukc.gov.ua/pro-tsentr-test/'
let task12 = str12.match(/\gov/g)
if(task12)console.log('Сайт є урядовим');
else console.log('Сайт не є урядовим');
// --------------------------------------------------------------------------------------

// Задача 13. Вибрати усі роки після 2021 року з отриманого повідомлення
console.log('Задача 13');
let str13 = 'Years 2020 2025 2019 2021 2023 2024 2026'
let task13 = str13.match(/\b20[2-9][2-9]\b/g)
console.log(task13);
// --------------------------------------------------------------------------------------

// Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном з України (починаєтсья на «+38»)
console.log('Задача 14');
let str14 = '+380954897767'
let task14 = str14.match(/^\+38/g)
if(task14===null)console.log('номер не український');
else console.log('номер український');
// -------------------------------------------------------------------------

//Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл. Замінити пробіл на дефіс.
console.log('Задача 15');
// let userName = prompt("Введіть ваше Прізвище та Ім'я")
// let task15 = userName.replace(/ /,'-')
// console.log(task15);
// ----------------------------------------------------------------------------------------------

// Задача 16. Користувач вводить дату у форматі «день.місяць.рік». 
// Отримати рядкове представлення дати у форматі «день/місяць/рік»
console.log('Задача 16');
// let userDate = prompt('Введіть дату','dd.mm.year' )
// let task16 = userDate.replaceAll('.','/')
// console.log(task16);
// ------------------------------------------------------------------------------------------------

// Задача 17. Користувач вводить день (номер дня (0-6) або «sun,mon,tue,wed,thu,fri,sat»). 
// Визначити, чи  є це день вихідним
console.log('Задача 17');
// let userDay =prompt('Введіть день тижня(0-6) або «sun,mon,tue,wed,thu,fri,sat»').toLowerCase()
// let task17 = userDay.match(/^(0|6|sun|sat)$/)
// if(task17) console.log('вихідний');
// else console.log('робочий день')















